In [1]:
import pandas as pd
import numpy as np

In [6]:
%ls /home/kiad/Atelier/workspace/'DOSSIER KAMEL'/'FICHIER INV-STK-17.xlsx'

'/home/kiad/Atelier/workspace/DOSSIER KAMEL/FICHIER INV-STK-17.xlsx'

In [2]:
df = pd.read_excel('/home/kiad/Atelier/workspace/DOSSIER KAMEL/FICHIER INV-STK-17.xlsx', dtype={"Référence":str})

In [3]:
df['Localisa.'] = df['Localisa.'].astype(object)

In [4]:
df.head(3)

,N°,Référence,Localisa.,Libellé-2017,Prix Unit-17,QTIT_R,QTIT_S,Montant-17
0,1,1428543692,NaN,NOTICE D'UTILISATION,1337.20,1,1.0,1337.20
1,2,6327651204,NaN,VIS A TETE BOMBEE,29.37,22,22.0,646.14
2,3,6327651211,NaN,VIS A TETE BOMBEE,81.58,17,17.0,1386.86

In [52]:
df.dtypes.unique()

array([dtype('int64'), dtype('O'), dtype('float64')], dtype=object)

In [65]:

df.rename(columns={'Libellé-2017':'Libelle_2017'}, inplace=True)
df.head(3)

,N°,Référence,Localisa.,Libelle_2017,Prix Unit-17,QTIT_R,QTIT_S,Montant-17
0,1,1428543692,NaN,NOTICE D'UTILISATION,1337.20,1.0,1.0,1337.20
1,2,6327651204,NaN,VIS A TETE BOMBEE,29.37,22.0,22.0,646.14
2,3,6327651211,NaN,VIS A TETE BOMBEE,81.58,17.0,17.0,1386.86

In [58]:
df[df.Libelle_2017 == 'VIS'].groupby('Montant-17').filter(lambda g: len(g) > 1000).groupby('Montant-17').size()

SyntaxError: invalid syntax (<ipython-input-58-0b12c6adb70a>, line 1)

In [74]:
raw_data= {'id': [1, 2], 'name': ['Harry Potter', 'Ron Weasley']}
df1 = pd.DataFrame(raw_data, columns=['id', 'name'])
raw_data= {'id': [3], 'name': ['Hermione Granger']}
df2 = pd.DataFrame(raw_data, columns= ['id', 'name'])

In [75]:
df1
df2

   id              name
0   3  Hermione Granger

In [71]:
df1

   id          name
0   1  Harry Potter
1   2   Ron Weasley

In [5]:
df.reset_index(drop=True, inplace=True)

In [6]:
df['QTIT_S']

0         1.0
1        22.0
2        17.0
3        31.0
4        16.0
5        40.0
6         7.0
7       125.0
8         3.0
9        17.0
10       51.0
11       12.0
12       10.0
13       20.0
14        6.0
15        1.0
16        5.0
17        5.0
18       50.0
19       42.0
20        4.0
21      112.0
22       27.0
23       10.0
24       44.0
25       10.0
26        8.0
27       10.0
28       10.0
29        1.0
        ...
1941      2.0
1942      1.0
1943      1.0
1944      4.0
1945      4.0
1946      1.0
1947      1.0
1948      1.0
1949      2.0
1950      3.0
1951      2.0
1952      1.0
1953      1.0
1954      1.0
1955      1.0
1956      1.0
1957      1.0
1958      1.0
1959      1.0
1960     10.0
1961      1.0
1962      1.0
1963      1.0
1964      1.0
1965      1.0
1966      2.0
1967      1.0
1968      1.0
1969      5.0
1970      1.0
Name: QTIT_S, Length: 1971, dtype: float64

In [7]:
from IPython.core.display import display, HTML
from string import Template
import json

In [8]:
%%html
<div id="mynetwork"></div>

In [10]:
%%javascript
requirejs.config({
    paths: {
        vis: 'vis'
    }
});

require(['vis'], function(vis){
    
    var nodes = [
        {id: 1, label: 'Beyonce', group: 'United States'},
        {id: 2, label: 'Barak Obama', group: 'United States'},
        {id: 3, label: 'Miley Cyrus', group: 'United States'},
        {id: 4, label: 'Pope Francis', group: 'Vatican'},
        {id: 5, label: 'Vladimir Putin', group: 'Rusia'}
    ];

    // create an array with edges
    var edges = [
        {from: 1, to: 2},
        {from: 1, to: 3},
        {from: 2, to: 4},
        {from: 2, to: 5}
    ];

    // create a network
    var container = document.getElementById('mynetwork');
    var data= {
        nodes: nodes,
        edges: edges,
    };
    var options = {
        width: '800px',
        height: '400px'
    };
    
    var network = new vis.Network(container, data, options);
});

In [ ]:
from IPython.core.display import display, HTML
from string import Template

nodes = [
        {'id': 1, 'label': 'Beyonce', 'group': 'United States'},
        {'id': 2, 'label': 'Barak Obama', 'group': 'United States'},
        {'id': 3, 'label': 'Miley Cyrus', 'group': 'United States'},
        {'id': 4, 'label': 'Pope Francis', 'group': 'Vatican'},
        {'id': 5, 'label': 'Vladimir Putin', 'group': 'Rusia'}
]

edges = [
        {'from': 1, 'to': 2},
        {'from': 1, 'to': 3},
        {'from': 2, 'to': 4},
        {'from': 2, 'to': 5}
]